tap "gromgit/brewtils"
tap "homebrew/autoupdate"
tap "nikitabobko/tap"
tap "oven-sh/bun"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "glib"
brew "at-spi2-core"
brew "blueutil"
brew "fastfetch"
brew "fd"
brew "unbound"
brew "gnutls"
brew "icu4c@78"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "gobject-introspection"
brew "gpgme"
brew "graphviz"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "httrack"
brew "python@3.12"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "libraqm"
brew "llvm"
brew "neovim"
brew "node"
brew "nushell"
brew "pandoc"
brew "parallel"
brew "pillow"
brew "poetry"
brew "poppler"
brew "postgresql@14"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "redis"
brew "resvg"
brew "ripgrep"
brew "ruff"
brew "sevenzip"
brew "shellcheck"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "uv"
brew "vim"
brew "wget"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "gromgit/brewtils/taproom"
brew "oven-sh/bun/bun"
cask "aerospace"
cask "droid"
cask "font-google-sans-code"
cask "font-symbols-only-nerd-font"
cask "gcloud-cli"
cask "iterm2"
cask "kitty"
cask "miniconda"
cask "mitmproxy"
cask "ngrok"
cask "wezterm"
vscode "antfu.slidev"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "bedirt.gpt-token-counter-live"
vscode "bungcip.better-toml"
vscode "charliermarsh.ruff"
vscode "dotjoshjohnson.xml"
vscode "dvirtz.parquet-viewer"
vscode "github.vscode-github-actions"
vscode "janisdd.vscode-edit-csv"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.live-server"
vscode "nimda.deepdark-material"
vscode "openai.chatgpt"
vscode "phu1237.vs-browser"
vscode "rust-lang.rust-analyzer"
vscode "sst-dev.opencode"
vscode "tauri-apps.tauri-vscode"
vscode "tomoki1207.pdf"
vscode "vscodevim.vim"
vscode "zeshuaro.vscode-python-poetry"
go "github.com/bootdotdev/bootdev"
